{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"outputs": {"final_output": {"name": "final_output"}}}}, "modelTopology": {"node": [{"name": "BiseNetV2/logits/1x1_conv_block/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "19"}]}}}}}, {"name": "BiseNetV2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "BiseNetV2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/detail_branch/1x1_conv_block/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/semantic_branch/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/semantic_branch/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/semantic_branch/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ce_block_3_repeat_1/context_embedding_block/global_avg_pooling/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/concate_features/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ce_block_3_repeat_1/context_embedding_block/final_conv_block/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/semantic_branch/1x1_conv_block/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/aggregation_features/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/aggregation_features/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/aggregation_features/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/Mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "BiseNetV2/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_tensor", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/conv_block_1/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/conv_block_1/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_3/gather_expansion_block/stride_equal_one_module/1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/detail_branch/stage_1/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/detail_branch/stage_1/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "8"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "BiseNetV2/detail_branch/stage_1/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/detail_branch/stage_1/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ce_block_3_repeat_1/context_embedding_block/conv_block_1/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ce_block_3_repeat_1/context_embedding_block/conv_block_1/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/detail_branch/stage_2/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "BiseNetV2/detail_branch/stage_2/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/final_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "16"}]}}}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/semantic_branch/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/final_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_2/3x3_conv/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/semantic_branch/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_2/3x3_conv/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_dw_conv_block/depthwise_conv_output_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_dw_conv_block/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "BiseNetV2/detail_branch/stage_3/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/semantic_branch/3x3_dw_conv_block/depthwise_conv_output_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "BiseNetV2/detail_branch/stage_3/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_1/depthwise_conv_output_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "6"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_1/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_2/depthwise_conv_output_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_2/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/detail_branch/stage_3/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/semantic_branch/3x3_dw_conv_block/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/detail_branch/stage_3/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "BiseNetV2/detail_branch/stage_3/conv_block_2_repeat_2/3x3_conv/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/detail_branch/stage_3/conv_block_2_repeat_2/3x3_conv/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/detail_branch/3x3_dw_conv_block/depthwise_conv_output_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/detail_branch/3x3_dw_conv_block/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/detail_branch/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/detail_branch/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/depthwise_conv_block/depthwise_conv_output_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "6"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/depthwise_conv_block/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}}}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/aggregation_features/aggregation_feature_output/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_dw_conv_block/depthwise_conv_output_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_dw_conv_block/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ce_block_3_repeat_1/context_embedding_block/bn/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "BiseNetV2/aggregation_branch/guided_aggregation_block/aggregation_features/aggregation_feature_output/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_1/depthwise_conv_output_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_1/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_2/depthwise_conv_output_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_2/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/depthwise_conv_block/depthwise_conv_output_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "6"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/depthwise_conv_block/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_4/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_dw_conv_block/depthwise_conv_output_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_dw_conv_block/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_1/depthwise_conv_output_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "6"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_1/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_2/depthwise_conv_output_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_2/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "128"}]}}}}}, {"name": "BiseNetV2/logits/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/logits/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/depthwise_conv_block/depthwise_conv_output_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/depthwise_conv_block/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "768"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ce_block_3_repeat_1/context_embedding_block/bn/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_1/gather_expansion_block/stride_equal_one_module/1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_2/gather_expansion_block/stride_equal_one_module/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_2/gather_expansion_block/stride_equal_one_module/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_2/gather_expansion_block/stride_equal_one_module/depthwise_conv_block/depthwise_conv_output_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "6"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_2/gather_expansion_block/stride_equal_one_module/depthwise_conv_block/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_2/gather_expansion_block/stride_equal_one_module/1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "768"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_2/gather_expansion_block/stride_equal_one_module/1x1_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_3/gather_expansion_block/stride_equal_one_module/3x3_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_3/gather_expansion_block/stride_equal_one_module/3x3_conv_block/conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_3/gather_expansion_block/stride_equal_one_module/depthwise_conv_block/depthwise_conv_output_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "6"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_3/gather_expansion_block/stride_equal_one_module/depthwise_conv_block/depthwise_conv_output_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_5/ge_block_2_repeat_3/gather_expansion_block/stride_equal_one_module/1x1_conv_block/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "768"}, {"size": "128"}]}}}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/conv_block_1/relu", "op": "_FusedConv2D", "input": ["input_tensor", "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/conv_block_1/conv/Conv2D_weights", "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/conv_block_1/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}}}, {"name": "BiseNetV2/detail_branch/stage_1/conv_block_1_repeat_1/3x3_conv/relu", "op": "_FusedConv2D", "input": ["input_tensor", "BiseNetV2/detail_branch/stage_1/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_weights", "BiseNetV2/detail_branch/stage_1/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_right/maxpooling_block", "op": "MaxPool", "input": ["BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/conv_block_1/relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/1x1_conv_block/relu", "op": "_FusedConv2D", "input": ["BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/conv_block_1/relu", "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/1x1_conv_block/conv/Conv2D_weights", "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/1x1_conv_block/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "BiseNetV2/detail_branch/stage_1/conv_block_2_repeat_1/3x3_conv/relu", "op": "_FusedConv2D", "input": ["BiseNetV2/detail_branch/stage_1/conv_block_1_repeat_1/3x3_conv/relu", "BiseNetV2/detail_branch/stage_1/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_weights", "BiseNetV2/detail_branch/stage_1/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/3x3_conv_block/relu", "op": "_FusedConv2D", "input": ["BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/1x1_conv_block/relu", "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/3x3_conv_block/conv/Conv2D_weights", "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/3x3_conv_block/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}}}, {"name": "BiseNetV2/detail_branch/stage_2/conv_block_1_repeat_1/3x3_conv/relu", "op": "_FusedConv2D", "input": ["BiseNetV2/detail_branch/stage_1/conv_block_2_repeat_1/3x3_conv/relu", "BiseNetV2/detail_branch/stage_2/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_weights", "BiseNetV2/detail_branch/stage_2/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/concate_features", "op": "ConcatV2", "input": ["BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_left/3x3_conv_block/relu", "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/downsample_branch_right/maxpooling_block", "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/concate_features/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_1/3x3_conv/relu", "op": "_FusedConv2D", "input": ["BiseNetV2/detail_branch/stage_2/conv_block_1_repeat_1/3x3_conv/relu", "BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_weights", "BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/final_conv_block/relu", "op": "_FusedConv2D", "input": ["BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/concate_features", "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/final_conv_block/conv/Conv2D_weights", "BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/final_conv_block/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_2/3x3_conv/relu", "op": "_FusedConv2D", "input": ["BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_1/3x3_conv/relu", "BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_2/3x3_conv/conv/Conv2D_weights", "BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_2/3x3_conv/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_dw_conv_block/depthwise_conv_output", "op": "FusedDepthwiseConv2dNative", "input": ["BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/final_conv_block/relu", "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_dw_conv_block/depthwise_conv_output_weights", "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/input_project_dw_conv_block/depthwise_conv_output_bn_offset"], "attr": {"padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/3x3_conv_block/relu", "op": "_FusedConv2D", "input": ["BiseNetV2/semantic_branch/stage_1/se_block_1_repeat_1/stem_block/final_conv_block/relu", "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/3x3_conv_block/conv/Conv2D_weights", "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/3x3_conv_block/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "BiseNetV2/detail_branch/stage_3/conv_block_1_repeat_1/3x3_conv/relu", "op": "_FusedConv2D", "input": ["BiseNetV2/detail_branch/stage_2/conv_block_2_repeat_2/3x3_conv/relu", "BiseNetV2/detail_branch/stage_3/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_weights", "BiseNetV2/detail_branch/stage_3/conv_block_1_repeat_1/3x3_conv/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_1/depthwise_conv_output", "op": "FusedDepthwiseConv2dNative", "input": ["BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/3x3_conv_block/relu", "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_1/depthwise_conv_output_weights", "BiseNetV2/semantic_branch/stage_3/ge_block_1_repeat_1/gather_expansion_block/stride_equal_two_module/depthwise_conv_block_1/depthwise_conv_output_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "BiseNetV2/detail_branch/stage_3/conv_block_2_repeat_1/3x3_conv/relu", "op": "_FusedConv2D", "input": ["BiseNetV2/detail_branch/stage_3/conv_block_1_repeat_1/3x3_conv/relu", "BiseNetV2/detail_branch/stage_3/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_weights", "BiseNetV2/detail_branch/stage_3/conv_block_2_repeat_1/3x3_conv/conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, 