{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.6.0", "userDefinedMetadata": {"signature": {"inputs": {"input_photo:0": {"name": "input_photo:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"final_output:0": {"name": "final_output:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "depthwise_5/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_3/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "generator/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/block_3/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_3/conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_3/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_3/conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_2/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_2/conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_2/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_2/conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_1/conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "generator/block_1/conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_1/conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "generator/block_1/conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_0/conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "generator/block_0/conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_0/conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "generator/block_0/conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_3/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_4/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_4/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "generator/Conv_5/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}}}, {"name": "generator/Conv_5/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "generator/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "generator/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "generator/Conv_2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_6/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_6/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "generator/Conv_7/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_7/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "generator/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_8/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_8/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "generator/Conv_9/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "32"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_9/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_2/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}}}, {"name": "depthwise_4/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "depthwise_1/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_6/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}}}, {"name": "ones/packed/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ones/packed/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ones/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_photo", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv/BiasAdd", "op": "_FusedConv2D", "input": ["input_photo", "generator/Conv/weights", "generator/Conv/biases"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "ArithmeticOptimizer/ReplaceMulWithSquare_mul_2", "op": "Square", "input": ["input_photo"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_1", "op": "DepthwiseConv2dNative", "input": ["input_photo", "depthwise_1/filter_in"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Shape", "op": "Shape", "input": ["input_photo"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "generator/LeakyRelu", "op": "LeakyRelu", "input": ["generator/Conv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "depthwise_4", "op": "DepthwiseConv2dNative", "input": ["ArithmeticOptimizer/ReplaceMulWithSquare_mul_2", "depthwise_4/filter_in"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["Shape", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "strided_slice_1", "op": "StridedSlice", "input": ["Shape", "strided_slice_1/stack", "strided_slice_1/stack_1", "strided_slice_1/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "generator/Conv_1/BiasAdd", "op": "_FusedConv2D", "input": ["generator/LeakyRelu", "generator/Conv_1/weights", "generator/Conv_1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "ones/packed", "op": "Pack", "input": ["ones/packed/0", "strided_slice", "strided_slice_1", "ones/packed/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "generator/LeakyRelu_1", "op": "LeakyRelu", "input": ["generator/Conv_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "ones", "op": "Fill", "input": ["ones/packed", "ones/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "generator/Conv_2/BiasAdd", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_1", "generator/Conv_2/weights", "generator/Conv_2/biases"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "depthwise", "op": "DepthwiseConv2dNative", "input": ["ones", "depthwise/filter_in"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "generator/LeakyRelu_2", "op": "LeakyRelu", "input": ["generator/Conv_2/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "truediv_3", "op": "RealDiv", "input": ["depthwise_4", "depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv", "op": "RealDiv", "input": ["depthwise_1", "depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_3/BiasAdd", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_2", "generator/Conv_3/weights", "generator/Conv_3/biases"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "ArithmeticOptimizer/ReplaceMulWithSquare_mul_3", "op": "Square", "input": ["truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/LeakyRelu_3", "op": "LeakyRelu", "input": ["generator/Conv_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "sub_1", "op": "Sub", "input": ["add/y", "ArithmeticOptimizer/ReplaceMulWithSquare_mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_4/BiasAdd", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_3", "generator/Conv_4/weights", "generator/Conv_4/biases"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "add", "op": "Add", "input": ["truediv_3", "sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/LeakyRelu_4", "op": "LeakyRelu", "input": ["generator/Conv_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "generator/block_0/conv1/BiasAdd", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_4", "generator/block_0/conv1/weights", "generator/block_0/conv1/biases"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "generator/block_0/LeakyRelu", "op": "LeakyRelu", "input": ["generator/block_0/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "generator/block_0/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_0/LeakyRelu", "generator/block_0/conv2/weights", "generator/block_0/conv2/biases"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/block_0/add", "op": "AddV2", "input": ["generator/block_0/conv2/BiasAdd", "generator/LeakyRelu_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/block_1/conv1/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_0/add", "generator/block_1/conv1/weights", "generator/block_1/conv1/biases"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "generator/block_1/LeakyRelu", "op": "LeakyRelu", "input": ["generator/block_1/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "generator/block_1/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_1/LeakyRelu", "generator/block_1/conv2/weights", "generator/block_1/conv2/biases"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "generator/block_1/add", "op": "AddV2", "input": ["generator/block_1/conv2/BiasAdd", "generator/block_0/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/block_2/conv1/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_1/add", "generator/block_2/conv1/weights", "generator/block_2/conv1/biases"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "generator/block_2/LeakyRelu", "op": "LeakyRelu", "input": ["generator/block_2/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "generator/block_2/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_2/LeakyRelu", "generator/block_2/conv2/weights", "generator/block_2/conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "generator/block_2/add", "op": "AddV2", "input": ["generator/block_2/conv2/BiasAdd", "generator/block_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/block_3/conv1/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_2/add", "generator/block_3/conv1/weights", "generator/block_3/conv1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "generator/block_3/LeakyRelu", "op": "LeakyRelu", "input": ["generator/block_3/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "generator/block_3/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_3/LeakyRelu", "generator/block_3/conv2/weights", "generator/block_3/conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "generator/block_3/add", "op": "AddV2", "input": ["generator/block_3/conv2/BiasAdd", "generator/block_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_5/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_3/add", "generator/Conv_5/weights", "generator/Conv_5/biases"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/LeakyRelu_5", "op": "LeakyRelu", "input": ["generator/Conv_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "generator/Shape", "op": "Shape", "input": ["generator/LeakyRelu_5"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "generator/Shape_1", "op": "Shape", "input": ["generator/LeakyRelu_5"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice", "op": "StridedSlice", "input": ["generator/Shape", "generator/strided_slice/stack", "generator/strided_slice/stack_1", "generator/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice_1", "op": "StridedSlice", "input": ["generator/Shape_1", "generator/strided_slice_1/stack", "generator/strided_slice_1/stack_1", "generator/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "generator/mul", "op": "Mul", "input": ["generator/strided_slice", "generator/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "generator/mul_1", "op": "Mul", "input": ["generator/strided_slice_1", "generator/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "generator/ResizeBilinear/size", "op": "Pack", "input": ["generator/mul", "generator/mul_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "generator/ResizeBilinear", "op": "ResizeBilinear", "input": ["generator/LeakyRelu_5", "generator/ResizeBilinear/size"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": false}}}, {"name": "generator/add", "op": "AddV2", "input": ["generator/ResizeBilinear", "generator/LeakyRelu_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_6/BiasAdd", "op": "_FusedConv2D", "input": ["generator/add", "generator/Conv_6/weights", "generator/Conv_6/biases"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "generator/LeakyRelu_6", "op": "LeakyRelu", "input": ["generator/Conv_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "generator/Conv_7/BiasAdd", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_6", "generator/Conv_7/weights", "generator/Conv_7/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "generator/LeakyRelu_7", "op": "LeakyRelu", "input": ["generator/Conv_7/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/Shape_2", "op": "Shape", "input": ["generator/LeakyRelu_7"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "generator/Shape_3", "op": "Shape", "input": ["generator/LeakyRelu_7"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice_2", "op": "StridedSlice", "input": ["generator/Shape_2", "generator/strided_slice_2/stack", "generator/strided_slice_2/stack_1", "generator/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "generator/strided_slice_3", "op": "StridedSlice", "input": ["generator/Shape_3", "generator/strided_slice_3/stack", "generator/strided_slice_3/stack_1", "generator/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "generator/mul_2", "op": "Mul", "input": ["generator/strided_slice_2", "generator/mul_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "generator/mul_3", "op": "Mul", "input": ["generator/strided_slice_3", "generator/mul_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "generator/ResizeBilinear_1/size", "op": "Pack", "input": ["generator/mul_2", "generator/mul_3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "generator/ResizeBilinear_1", "op": "ResizeBilinear", "input": ["generator/LeakyRelu_7", "generator/ResizeBilinear_1/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/add_1", "op": "AddV2", "input": ["generator/ResizeBilinear_1", "generator/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_8/BiasAdd", "op": "_FusedConv2D", "input": ["generator/add_1", "generator/Conv_8/weights", "generator/Conv_8/biases"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "generator/LeakyRelu_8", "op": "LeakyRelu", "input": ["generator/Conv_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "generator/Conv_9/BiasAdd", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_8", "generator/Conv_9/weights", "generator/Conv_9/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "depthwise_2", "op": "DepthwiseConv2dNative", "input": ["generator/Conv_9/BiasAdd", "depthwise_2/filter_in"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "mul", "op": "Mul", "input": ["input_photo", "generator/Conv_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "RealDiv", "input": ["depthwise_2", "depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_3", "op": "DepthwiseConv2dNative", "input": ["mul", "depthwise_3/filter_in"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "mul_1", "op": "Mul", "input": ["truediv", "truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_2", "op": "RealDiv", "input": ["depthwise_3", "depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["truediv_2", "mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_4", "op": "RealDiv", "input": ["sub", "add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_5", "op": "DepthwiseConv2dNative", "input": ["truediv_4", "depthwise_5/filter_in"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "mul_4", "op": "Mul", "input": ["truediv_4", "truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_5", "op": "RealDiv", "input": ["depthwise_5", "depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_2", "op": "Sub", "input": ["truediv_1", "mul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_5", "op": "Mul", "input": ["truediv_5", "input_photo"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_6", "op": "DepthwiseConv2dNative", "input": ["sub_2", "depthwise_6/filter_in"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "truediv_6", "op": "RealDiv", "input": ["depthwise_6", "depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["mul_5", "truediv_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "final_output", "op": "Identity", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "depthwise_5/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1111111119389534, "scale": 1.0, "original_dtype": "float32"}}, {"name": "depthwise_3/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1111111119389534, "scale": 1.0, "original_dtype": "float32"}}, {"name": "generator/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "generator/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "generator/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "generator/mul_2/y", "shape": [], "dtype": "int32"}, {"name": "generator/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "generator/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "generator/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "generator/mul/y", "shape": [], "dtype": "int32"}, {"name": "generator/block_3/conv1/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.22084014918289932, "scale": 0.0015887780516755346, "original_dtype": "float32"}}, {"name": "generator/block_3/conv1/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16185247474441342, "scale": 0.000735693067020061, "original_dtype": "float32"}}, {"name": "generator/block_3/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17605795369428748, "scale": 0.0014550244106965907, "original_dtype": "float32"}}, {"name": "generator/block_3/conv2/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03943661144551108, "scale": 0.00033706505508983834, "original_dtype": "float32"}}, {"name": "generator/block_2/conv1/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1758582576232798, "scale": 0.0014297419318965838, "original_dtype": "float32"}}, {"name": "generator/block_2/conv1/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11882321390451168, "scale": 0.0006062408872679168, "original_dtype": "float32"}}, {"name": "generator/block_2/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1716891758582171, "scale": 0.0013845901278888477, "original_dtype": "float32"}}, {"name": "generator/block_2/conv2/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04040788417937709, "scale": 0.0003339494560279098, "original_dtype": "float32"}}, {"name": "generator/block_1/conv1/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1809734451420167, "scale": 0.0014956483069588156, "original_dtype": "float32"}}, {"name": "generator/block_1/conv1/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12373276049015568, "scale": 0.0005333308641817055, "original_dtype": "float32"}}, {"name": "generator/block_1/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1817400111871607, "scale": 0.0013768182665693993, "original_dtype": "float32"}}, {"name": "generator/block_1/conv2/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.030564671973971762, "scale": 0.00019344729097450482, "original_dtype": "float32"}}, {"name": "generator/block_0/conv1/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3216101681484896, "scale": 0.002061603641977497, "original_dtype": "float32"}}, {"name": "generator/block_0/conv1/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09552246404483038, "scale": 0.00045704528251115016, "original_dtype": "float32"}}, {"name": "generator/block_0/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1945579454010608, "scale": 0.0015199839484457875, "original_dtype": "float32"}}, {"name": "generator/block_0/conv2/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.024452958880540204, "scale": 0.00015575133044930066, "original_dtype": "float32"}}, {"name": "generator/Conv_3/weights", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5706853395583582, "scale": 0.0035446294382506724, "original_dtype": "float32"}}, {"name": "generator/Conv_3/biases", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09123389861162971, "scale": 0.0006335687403585397, "original_dtype": "float32"}}, {"name": "generator/Conv_4/weights", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.29045896793113035, "scale": 0.0020599926803626266, "original_dtype": "float32"}}, {"name": "generator/Conv_4/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09685239981786878, "scale": 0.00046340861156875013, "original_dtype": "float32"}}, {"name": "generator/Conv_5/weights", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19785751805585974, "scale": 0.0015337792097353468, "original_dtype": "float32"}}, {"name": "generator/Conv_5/biases", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11703464432674296, "scale": 0.0008669232913092071, "original_dtype": "float32"}}, {"name": "generator/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "generator/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "generator/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "generator/mul_1/y", "shape": [], "dtype": "int32"}, {"name": "generator/Conv_1/weights", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5959757075590246, "scale": 0.003724848172243904, "original_dtype": "float32"}}, {"name": "generator/Conv_1/biases", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09598891220840754, "scale": 0.0007163351657343846, "original_dtype": "float32"}}, {"name": "generator/Conv_2/weights", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.43265179442424395, "scale": 0.0029838054787878895, "original_dtype": "float32"}}, {"name": "generator/Conv_2/biases", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12450774697696461, "scale": 0.0008646371317844765, "original_dtype": "float32"}}, {"name": "generator/Conv_6/weights", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6253524913507349, "scale": 0.0037900150990953633, "original_dtype": "float32"}}, {"name": "generator/Conv_6/biases", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1269915305516299, "scale": 0.0010159322444130393, "original_dtype": "float32"}}, {"name": "generator/Conv_7/weights", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5704397250624265, "scale": 0.004045671808953379, "original_dtype": "float32"}}, {"name": "generator/Conv_7/biases", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06815012296040854, "scale": 0.0008967121442159017, "original_dtype": "float32"}}, {"name": "generator/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "generator/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "generator/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "generator/mul_3/y", "shape": [], "dtype": "int32"}, {"name": "generator/Conv/weights", "shape": [7, 7, 3, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.31890247586895437, "scale": 0.0021993274197858923, "original_dtype": "float32"}}, {"name": "generator/Conv/biases", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20848759658196392, "scale": 0.0012712658328168532, "original_dtype": "float32"}}, {"name": "generator/Conv_8/weights", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0400230753655528, "scale": 0.006227683086021274, "original_dtype": "float32"}}, {"name": "generator/Conv_8/biases", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03705770741490757, "scale": 0.0006862538410168068, "original_dtype": "float32"}}, {"name": "generator/Conv_9/weights", "shape": [7, 7, 32, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3361294344359753, "scale": 0.002418197370042988, "original_dtype": "float32"}}, {"name": "generator/Conv_9/biases", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.034438492226250034, "scale": 0.0002342754573214288, "original_dtype": "float32"}}, {"name": "depthwise_2/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1111111119389534, "scale": 1.0, "original_dtype": "float32"}}, {"name": "depthwise_4/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1111111119389534, "scale": 1.0, "original_dtype": "float32"}}, {"name": "add/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.004999999888241291, "scale": 1.0, "original_dtype": "float32"}}, {"name": "depthwise_1/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1111111119389534, "scale": 1.0, "original_dtype": "float32"}}, {"name": "depthwise_6/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1111111119389534, "scale": 1.0, "original_dtype": "float32"}}, {"name": "ones/packed/0", "shape": [], "dtype": "int32"}, {"name": "strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "ones/packed/3", "shape": [], "dtype": "int32"}, {"name": "ones/Const", "shape": [], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "depthwise/filter_in", "shape": [3, 3, 1, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1111111119389534, "scale": 1.0, "original_dtype": "float32"}}]}]}